In [35]:
import pandas as pd

df = pd.read_excel('../data/housing_data_gr.xlsx')

In [36]:
len(df)

20000

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 25 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   location_name      20000 non-null  object
 1   location_region    20000 non-null  object
 2   res_date           20000 non-null  object
 3   res_type           20000 non-null  object
 4   res_address        20000 non-null  object
 5   res_price          20000 non-null  int64
 6   res_price_sqr      19998 non-null  float64
 7   res_sqr            19999 non-null  float64
 8   construction_year  19214 non-null  float64
 9   levels             19992 non-null  object
 10  bedrooms           18935 non-null  float64
 11  bathrooms          18214 non-null  float64
 12  deleted            20000 non-null  int64
 13  deleted_at         16885 non-null  object
 14  status             18195 non-null  object
 15  energyclass        18186 non-null  object
 16  auto_heating       20000 non-null  int64
 17  solar              20000 non-null  int64
 18  cooling            20000 non-null  int64
 19  safe_door          20000 non-null  int64
 20  gas                20000 non-null  int64
 21  fireplace          20000 non-null  int64
 22  furniture          20000 non-null  int64
 23  student            20000 non-null  int64
 24  parking            3315 non-null   object
dtypes: float64(5), int64(10), object(10)
memory usage: 3.8+ MB

In [38]:
df['parking'] = df['parking'].fillna(False)

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 25 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   location_name      20000 non-null  object
 1   location_region    20000 non-null  object
 2   res_date           20000 non-null  object
 3   res_type           20000 non-null  object
 4   res_address        20000 non-null  object
 5   res_price          20000 non-null  int64
 6   res_price_sqr      19998 non-null  float64
 7   res_sqr            19999 non-null  float64
 8   construction_year  19214 non-null  float64
 9   levels             19992 non-null  object
 10  bedrooms           18935 non-null  float64
 11  bathrooms          18214 non-null  float64
 12  deleted            20000 non-null  int64
 13  deleted_at         16885 non-null  object
 14  status             18195 non-null  object
 15  energyclass        18186 non-null  object
 16  auto_heating       20000 non-null  int64
 17  solar              20000 non-null  int64
 18  cooling            20000 non-null  int64
 19  safe_door          20000 non-null  int64
 20  gas                20000 non-null  int64
 21  fireplace          20000 non-null  int64
 22  furniture          20000 non-null  int64
 23  student            20000 non-null  int64
 24  parking            20000 non-null  object
dtypes: float64(5), int64(10), object(10)
memory usage: 3.8+ MB

In [40]:
df=df.drop(columns=['deleted_at','deleted'])

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 23 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   location_name      20000 non-null  object
 1   location_region    20000 non-null  object
 2   res_date           20000 non-null  object
 3   res_type           20000 non-null  object
 4   res_address        20000 non-null  object
 5   res_price          20000 non-null  int64
 6   res_price_sqr      19998 non-null  float64
 7   res_sqr            19999 non-null  float64
 8   construction_year  19214 non-null  float64
 9   levels             19992 non-null  object
 10  bedrooms           18935 non-null  float64
 11  bathrooms          18214 non-null  float64
 12  status             18195 non-null  object
 13  energyclass        18186 non-null  object
 14  auto_heating       20000 non-null  int64
 15  solar              20000 non-null  int64
 16  cooling            20000 non-null  int64
 17  safe_door          20000 non-null  int64
 18  gas                20000 non-null  int64
 19  fireplace          20000 non-null  int64
 20  furniture          20000 non-null  int64
 21  student            20000 non-null  int64
 22  parking            20000 non-null  object
dtypes: float64(5), int64(9), object(9)
memory usage: 3.5+ MB

In [42]:
df = df.dropna()

In [43]:
len(df)

15136

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15136 entries, 0 to 19999
Data columns (total 23 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   location_name      15136 non-null  object
 1   location_region    15136 non-null  object
 2   res_date           15136 non-null  object
 3   res_type           15136 non-null  object
 4   res_address        15136 non-null  object
 5   res_price          15136 non-null  int64
 6   res_price_sqr      15136 non-null  float64
 7   res_sqr            15136 non-null  float64
 8   construction_year  15136 non-null  float64
 9   levels             15136 non-null  object
 10  bedrooms           15136 non-null  float64
 11  bathrooms          15136 non-null  float64
 12  status             15136 non-null  object
 13  energyclass        15136 non-null  object
 14  auto_heating       15136 non-null  int64
 15  solar              15136 non-null  int64
 16  cooling            15136 non-null  int64
 17  safe_door          15136 non-null  int64
 18  gas                15136 non-null  int64
 19  fireplace          15136 non-null  int64
 20  furniture          15136 non-null  int64
 21  student            15136 non-null  int64
 22  parking            15136 non-null  object
dtypes: float64(5), int64(9), object(9)
memory usage: 2.8+ MB

In [45]:
df.describe()

,res_price,res_price_sqr,res_sqr,construction_year,bedrooms,bathrooms,auto_heating,solar,cooling,safe_door,gas,fireplace,furniture,student
count,1.513600e+04,15136.000000,15136.000000,15136.000000,15136.000000,15136.000000,15136.000000,15136.000000,15136.000000,15136.000000,15136.000000,15136.000000,15136.000000,15136.000000
mean,3.384809e+05,2472.245177,132.498084,1991.533430,2.534752,1.455735,0.540962,0.289508,0.364892,0.598969,0.165499,0.364561,0.071617,0.071749
std,4.904821e+05,2266.813242,164.370665,22.087628,1.536038,1.119262,0.498336,0.453549,0.481416,0.490123,0.371643,0.481323,0.257862,0.258081
min,4.300000e+01,1.000000,10.000000,1900.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1.230000e+05,1462.000000,71.000000,1973.000000,2.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,2.200000e+05,2188.000000,97.000000,1990.000000,2.000000,1.000000,1.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
75%,3.800000e+05,3100.000000,140.000000,2010.000000,3.000000,2.000000,1.000000,1.000000,1.000000,1.000000,0.000000,1.000000,0.000000,0.000000
max,2.500000e+07,208333.000000,12677.000000,2022.000000,39.000000,26.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [46]:
df["rent_price"]=(df["res_price"]*0.005).astype(int)

In [47]:
df.head(1)

,location_name,location_region,res_date,res_type,res_address,res_price,res_price_sqr,res_sqr,construction_year,levels,...,auto_heating,solar,cooling,safe_door,gas,fireplace,furniture,student,parking,rent_price
0,Παλαιό Φάληρο,Αττική,2021-06-18,Διαμέρισμα,"Παλαιό Φάληρο,Γήπεδα",89000,1618.0,55.0,1973.0,Υπερυψωμένο,...,1,0,1,1,0,0,0,0,False,445

In [48]:
df.to_excel('../data/dataset_ready_for_pre_proc.xlsx', index=False)